ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/component/emafelpfif.h
#define EMAFE_SR_CHBEVT (0x1u << 1) /**< \brief (EMAFE_SR) Event on Channel B */
/* -------- EMAFE_WPMR : (EMAFELPFIF Offset: 0xE4) Write Protection Mode Register -------- */
#define EMAFE_WPMR_WPCFEN (0x1u << 0) /**< \brief (EMAFE_WPMR) Write Protection Configuration Enable */
#define EMAFE_WPMR_WPITEN (0x1u << 1) /**< \brief (EMAFE_WPMR) Write Protection Interrupt Enable */
#define EMAFE_WPMR_WPCTRL (0x1u << 2) /**< \brief (EMAFE_WPMR) Write Protection Control */
#define EMAFE_WPMR_WPKEY_Pos 8
#define EMAFE_WPMR_WPKEY_Msk (0xffffffu << EMAFE_WPMR_WPKEY_Pos) /**< \brief (EMAFE_WPMR) Write Protection Key */
#define EMAFE_WPMR_WPKEY(value) ((EMAFE_WPMR_WPKEY_Msk & ((value) << EMAFE_WPMR_WPKEY_Pos)))
#define   EMAFE_WPMR_WPKEY_PASSWD (0x768070u << 8) /**< \brief (EMAFE_WPMR) Writing any other value in this field aborts the write operation of the WPCFEN and WPITEN bit. Always reads as 0. */
/* -------- EMAFE_WPSR : (EMAFELPFIF Offset: 0xE8) Write Protection Status Register -------- */
#define EMAFE_WPSR_WPVS (0x1u << 0) /**< \brief (EMAFE_WPSR) Write Protection Violation Status */
#define EMAFE_WPSR_WPVSRC_Pos 8
#define EMAFE_WPSR_WPVSRC_Msk (0xffffu << EMAFE_WPSR_WPVSRC_Pos) /**< \brief (EMAFE_WPSR) Write Protection Violation Source */
/* -------- EMAFE_VERSION : (EMAFELPFIF Offset: 0xFC) Version Register -------- */
#define EMAFE_VERSION_VERSION_Pos 0
#define EMAFE_VERSION_VERSION_Msk (0xffffu << EMAFE_VERSION_VERSION_Pos) /**< \brief (EMAFE_VERSION) Version of the Hardware Module */
#define EMAFE_VERSION_MFN_Pos 16
#define EMAFE_VERSION_MFN_Msk (0xfu << EMAFE_VERSION_MFN_Pos) /**< \brief (EMAFE_VERSION) Metal Fix Number */
/* -------- EMAFE_RPR : (EMAFELPFIF Offset: 0x100) Receive Pointer Register -------- */
#define EMAFE_RPR_RXPTR_Pos 0
#define EMAFE_RPR_RXPTR_Msk (0xffffffffu << EMAFE_RPR_RXPTR_Pos) /**< \brief (EMAFE_RPR) Receive Pointer Register */
#define EMAFE_RPR_RXPTR(value) ((EMAFE_RPR_RXPTR_Msk & ((value) << EMAFE_RPR_RXPTR_Pos)))
/* -------- EMAFE_RCR : (EMAFELPFIF Offset: 0x104) Receive Counter Register -------- */
#define EMAFE_RCR_RXCTR_Pos 0
#define EMAFE_RCR_RXCTR_Msk (0xffffu << EMAFE_RCR_RXCTR_Pos) /**< \brief (EMAFE_RCR) Receive Counter Register */
#define EMAFE_RCR_RXCTR(value) ((EMAFE_RCR_RXCTR_Msk & ((value) << EMAFE_RCR_RXCTR_Pos)))
/* -------- EMAFE_RNPR : (EMAFELPFIF Offset: 0x110) Receive Next Pointer Register -------- */
#define EMAFE_RNPR_RXNPTR_Pos 0
#define EMAFE_RNPR_RXNPTR_Msk (0xffffffffu << EMAFE_RNPR_RXNPTR_Pos) /**< \brief (EMAFE_RNPR) Receive Next Pointer */
#define EMAFE_RNPR_RXNPTR(value) ((EMAFE_RNPR_RXNPTR_Msk & ((value) << EMAFE_RNPR_RXNPTR_Pos)))
/* -------- EMAFE_RNCR : (EMAFELPFIF Offset: 0x114) Receive Next Counter Register -------- */
#define EMAFE_RNCR_RXNCTR_Pos 0
#define EMAFE_RNCR_RXNCTR_Msk (0xffffu << EMAFE_RNCR_RXNCTR_Pos) /**< \brief (EMAFE_RNCR) Receive Next Counter */
#define EMAFE_RNCR_RXNCTR(value) ((EMAFE_RNCR_RXNCTR_Msk & ((value) << EMAFE_RNCR_RXNCTR_Pos)))
/* -------- EMAFE_PTCR : (EMAFELPFIF Offset: 0x120) Transfer Control Register -------- */
#define EMAFE_PTCR_RXTEN (0x1u << 0) /**< \brief (EMAFE_PTCR) Receiver Transfer Enable */
#define EMAFE_PTCR_RXTDIS (0x1u << 1) /**< \brief (EMAFE_PTCR) Receiver Transfer Disable */
#define EMAFE_PTCR_TXTEN (0x1u << 8) /**< \brief (EMAFE_PTCR) Transmitter Transfer Enable */
#define EMAFE_PTCR_TXTDIS (0x1u << 9) /**< \brief (EMAFE_PTCR) Transmitter Transfer Disable */
#define EMAFE_PTCR_RXCBEN (0x1u << 16) /**< \brief (EMAFE_PTCR) Receiver Circular Buffer Enable */
#define EMAFE_PTCR_RXCBDIS (0x1u << 17) /**< \brief (EMAFE_PTCR) Receiver Circular Buffer Disable */
#define EMAFE_PTCR_TXCBEN (0x1u << 18) /**< \brief (EMAFE_PTCR) Transmitter Circular Buffer Enable */
#define EMAFE_PTCR_TXCBDIS (0x1u << 19) /**< \brief (EMAFE_PTCR) Transmitter Circular Buffer Disable */
#define EMAFE_PTCR_ERRCLR (0x1u << 24) /**< \brief (EMAFE_PTCR) Transfer Bus Error Clear */
/* -------- EMAFE_PTSR : (EMAFELPFIF Offset: 0x124) Transfer Status Register -------- */
#define EMAFE_PTSR_RXTEN (0x1u << 0) /**< \brief (EMAFE_PTSR) Receiver Transfer Enable */
#define EMAFE_PTSR_TXTEN (0x1u << 8) /**< \brief (EMAFE_PTSR) Transmitter Transfer Enable */
#define EMAFE_PTSR_RXCBEN (0x1u << 16) /**< \brief (EMAFE_PTSR) Receiver Circular Buffer Enable */
#define EMAFE_PTSR_TXCBEN (0x1u << 18) /**< \brief (EMAFE_PTSR) Transmitter Circular Buffer Enable */
#define EMAFE_PTSR_ERR (0x1u << 24) /**< \brief (EMAFE_PTSR) Transfer Bus Error */
/* -------- EMAFE_PWPMR : (EMAFELPFIF Offset: 0x128) Write Protection Mode Register -------- */
#define EMAFE_PWPMR_WPPTREN (0x1u << 0) /**< \brief (EMAFE_PWPMR) Write Protection Pointer Registers Enable */
#define EMAFE_PWPMR_WPCTREN (0x1u << 1) /**< \brief (EMAFE_PWPMR) Write Protection Counter Registers Enable */
#define EMAFE_PWPMR_WPCREN (0x1u << 2) /**< \brief (EMAFE_PWPMR) Write Protection Control Register Enable */
#define EMAFE_PWPMR_WPKEY_Pos 8
#define EMAFE_PWPMR_WPKEY_Msk (0xffffffu << EMAFE_PWPMR_WPKEY_Pos) /**< \brief (EMAFE_PWPMR) Write Protection Key */
#define EMAFE_PWPMR_WPKEY(value) ((EMAFE_PWPMR_WPKEY_Msk & ((value) << EMAFE_PWPMR_WPKEY_Pos)))
#define   EMAFE_PWPMR_WPKEY_PASSWD (0x504443u << 8) /**< \brief (EMAFE_PWPMR) Writing any other value in this field aborts the write operation. Always reads as 0. */

/*@}*/


#endif /* _PIC32CX_EMAFELPFIF_COMPONENT_ */
